{
  "about": [
    {
      "id": "0",
      "title": "Education",
      "text": "I first took an interest in programming during high school, having been curious about technology from a young age. I spent much of my free time in tenth grade teaching myself Javascript fundamentals and completed an honors class in C++ the following year. \n\nBy the time I started college, I had made up my mind to study Computer Science and focused my efforts on mastering Java. After developing a strong foundation in Object-Oriented Programming, I explored other avenues such as Flask web development and Linux application development with C. \n\nI completed my degree by designing and building a workout tracker app for Android that integrated a SQLite database and followed Material design conventions."
    },
    {
      "id": "1",
      "title": "Experience",
      "text": "Throughout college, I worked as an IT technician and solved technical issues brought forth by students and staff. I also assisted in configuring new hardware and software across campus. The position taught me how to more effectively communicate my thought process, especially to those who were not as technically inclined. \n\nIn my Senior year of college, I secured an internship with a zero-knowledge digital identity startup called Journey. During this internship, I was responsible for designing and implementing a biometric authentication system for the office doors. Additionally, I worked with project managers to develop automatic google cloud functions for streamlining new hire onboarding and maintaining SOC-2 compliance. While my internship was specifically focused on software engineering, I also collaborated with the DevOps team to configure and maintain cloud infrastructure using Terraform. \n\nMy experience with Journey helped me hone my ability to learn quickly and apply my knowledge to real-world software projects. During this internship, I was challenged to become competent in front and backend web development with modern technologies in a matter of months, and through perseverance, succeeded."
    }
  ]
}